#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// Какое-то примечание
	// Еще какое-то примечание
	// И еще примечание
	// Примечание - примечание
	// Крайнее примечание
	// Тупое примечание
	// Изменил регистрацию в ГитХаб
	// Все еще пробую...
	// Проверка отслеживания на GitHub
#Область ПрограммныйИнтерфейс

// Проверить существование по названию.
// 
// Параметры:
//  НазваниеТовара - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ПроверитьСуществованиеПоНазванию(НазваниеТовара) Экспорт
	ТоварСсылка = НайтиПоНаименованию(НазваниеТовара, Истина);
	Возврат НЕ ТоварСсылка.Пустая();
КонецФункции

#КонецОбласти

#КонецЕсли